000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. PRIMECHECK.
000003
000010 DATA DIVISION.
000011   WORKING-STORAGE SECTION.
000012   01 WS-CNT          PIC 9(4) VALUE 0.
000013   01 WS-PRIME        PIC 9(4).
000014   01 WS-RESULT       PIC 9(4).
000015   01 WS-REM          PIC 9(4).
000016   01 WS-PRIME-FLAG   PIC X(1) VALUE 'Y'.
000030
000050 PROCEDURE DIVISION.
000053 MAIN.
000055     DISPLAY 'Type integer greater than 3:'
000060     ACCEPT WS-PRIME
000065 
000065     IF WS-PRIME < 3 THEN
000070         DISPLAY 'You entered incorrect number!'
000080     ELSE
000100         PERFORM CHECK-PRIME VARYING WS-CNT FROM 3
000180             BY 1 UNTIL WS-CNT = WS-PRIME.
000190         PERFORM DISPLAY-RESULT.
000190 STOP RUN.
001000 CHECK-PRIME.
001002     DIVIDE WS-PRIME BY WS-CNT GIVING WS-RESULT REMAINDER WS-REM.
001004     IF WS-REM IS EQUAL TO ZERO AND WS-PRIME
001006               IS NOT EQUAL TO WS-CNT
001008         MOVE 'N' TO WS-PRIME-FLAG.
002000 DISPLAY-RESULT.
002010     IF WS-PRIME-FLAG IS EQUAL TO 'Y' THEN
002020         DISPLAY 'It is a prime number.'
002030     ELSE
002040         DISPLAY 'It is not a prime number.'
002050
002100 STOP RUN.

