000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. PRIMECHECK.
000003
000010 DATA DIVISION.
000011   WORKING-STORAGE SECTION.
000012   01 WS-CNT          PIC 9(4) VALUE 0.
000013   01 WS-PRIME        PIC 9(4).
000014   01 WS-RESULT       PIC 9(4).
000015   01 WS-REM          PIC 9(4).
000030
000050 PROCEDURE DIVISION.
000053   MAIN.
000055   DISPLAY 'Type integer greater than 3:'
000060   ACCEPT WS-PRIME
000065   IF WS-PRIME < 3 THEN
000070     DISPLAY 'You entered incorrect number!'
000080   ELSE
000100	   PERFORM CHECK-PRIME VARYING WS-CNT FROM 3
000180       BY 1 UNTIL WS-CNT = WS-PRIME
000120   END-IF
000200   STOP RUN.
001000 CHECK-PRIME.
001002   DIVIDE WS-PRIME BY WS-CNT GIVING WS-RESULT REMAINDER WS-REM.
001003   IF WS-REM IS EQUAL TO ZERO AND WS-PRIME IS NOT EQUAL TO WS-CNT
001004     DISPLAY 'It is prime number.'
001006   END-IF.

